app/controllers/announcer_controller.rb

  def shuffle
    session[:current_list] = params[:id]
    List.find(params[:id]).shuffle
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 2]]

	def show
    @wordlist_index = params[:id].to_i
    @wordlist_index = 1 if(@wordlist_index == 0)

    @wordlist_count = ListWord.find_all_by_list_id(@current_list_id).count
    @word = ListWord.find_by_list_id_and_order(@current_list_id, @wordlist_index).word
---
SELECT "list_words".* FROM "list_words" WHERE "list_words"."list_id" = 2 AND "list_words"."order" = 1 LIMIT 1